{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8fd2e77e-cb10-4805-8bb5-6a72e8555e82",
   "metadata": {},
   "source": [
    "This is an example of SPARQL Wikidata access."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd53e260-452b-4c62-9c0a-234f97c65755",
   "metadata": {},
   "source": [
    "First of all, we include all the python packages that are required to run this example. We will use the SPARQL endpoint to query the data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "66c0f558-0785-41ad-846b-08447a2c6f5a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON, RDFXML, POST\n",
    "\n",
    "sparql = SPARQLWrapper(\n",
    "    \"https://query.wikidata.org/sparql\"\n",
    ")\n",
    "\n",
    "sparql.setMethod(POST)\n",
    "sparql.setReturnFormat(JSON)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c881bb09-4d19-4623-bfeb-72cbb24bb33f",
   "metadata": {},
   "source": [
    "Now, we define the SPARQL query. We will retrieve authors from the movement Spanish Golden Age (wd:Q530936), including a picture if available. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "9a8e043e-8907-4d9d-b4b2-dcd8d125cfaa",
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql.setQuery(\"\"\"\n",
    "SELECT distinct ?s ?sLabel ?idBvmc ?image\n",
    "WHERE {\n",
    "    ?s wdt:P2799 ?idBvmc .\n",
    "    ?s wdt:P135 wd:Q530936 .\n",
    "    OPTIONAL{ ?s wdt:P18 ?image }\n",
    "    SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "limit 100\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1d38ff5-a25d-49ad-a09a-dd9913daca81",
   "metadata": {},
   "source": [
    "Finally, we can retrieve the triples as JSON and save it as a file using the following code:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a49ec049-7261-4042-aa90-16539c6ad4ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.wikidata.org/entity/Q2905689 - María de Zayas - 105\n",
      "http://www.wikidata.org/entity/Q5948891 - Juan Cortés de Tolosa - 152\n",
      "http://www.wikidata.org/entity/Q3893270 - Alonso Jerónimo de Salas Barbadillo - 895\n",
      "http://www.wikidata.org/entity/Q165257 - Lope de Vega - 72\n",
      "http://www.wikidata.org/entity/Q5682 - Miguel de Cervantes - 40\n",
      "http://www.wikidata.org/entity/Q201315 - Francisco Quevedo - 6\n",
      "http://www.wikidata.org/entity/Q5551713 - Jerónimo de Pasamonte - 6748\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "try:\n",
    "    ret = sparql.queryAndConvert()\n",
    "    #print(ret)\n",
    "    for r in ret[\"results\"][\"bindings\"]:\n",
    "        print(r[\"s\"][\"value\"] + \" - \" + r[\"sLabel\"][\"value\"] + \" - \" + r[\"idBvmc\"][\"value\"])\n",
    "\n",
    "    json_str = json.dumps(ret)\n",
    "    with open(\"bvmc.json\", \"w\") as f:\n",
    "        f.write(json_str)\n",
    "\n",
    "except Exception as e:\n",
    "    print(e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "23b25e95-0cc5-4be3-8e0a-af17864ba5ae",
   "metadata": {},
   "source": [
    "And now we can see the JSON content in the file bvmc.json"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
